; domain
( DEFINE ( DOMAIN SOKOBAN-TEMPORAL )
( :REQUIREMENTS :CONDITIONAL-EFFECTS :TYPING )
( :TYPES
	LOCATION - OBJECT
	T1 - OBJECT
	DIRECTION - OBJECT
	STONE - T1
	PLAYER - T1
)
( :PREDICATES
	( AT ?T10 - T1 ?LOCATION1 - LOCATION )
	( CLEAR ?LOCATION0 - LOCATION )
	( MOVE-DIR ?LOCATION0 - LOCATION ?LOCATION1 - LOCATION ?DIRECTION2 - DIRECTION )
)
( :ACTION MOVE
  :PARAMETERS ( ?PLAYER0 - PLAYER ?LOCATION1 - LOCATION ?LOCATION2 - LOCATION ?DIRECTION3 - DIRECTION )
  :PRECONDITION
	( AND
		( CLEAR ?LOCATION2 )
		( AT ?PLAYER0 ?LOCATION1 )
		( NOT ( AT ?PLAYER0 ?LOCATION2 ) )
		( MOVE-DIR ?LOCATION1 ?LOCATION2 ?DIRECTION3 )
	)
  :EFFECT
	( AND
		( CLEAR ?LOCATION1 )
		( AT ?PLAYER0 ?LOCATION2 )
		( NOT ( CLEAR ?LOCATION2 ) )
		( NOT ( AT ?PLAYER0 ?LOCATION1 ) )
	)
)
( :ACTION PUSH
  :PARAMETERS ( ?PLAYER0 - PLAYER ?STONE1 - STONE ?LOCATION2 - LOCATION ?LOCATION3 - LOCATION ?LOCATION4 - LOCATION ?DIRECTION5 - DIRECTION )
  :PRECONDITION
	( AND
		( NOT ( AT ?STONE1 ?LOCATION4 ) )
		( AT ?STONE1 ?LOCATION3 )
		( NOT ( CLEAR ?LOCATION2 ) )
		( CLEAR ?LOCATION4 )
		( NOT ( AT ?PLAYER0 ?LOCATION3 ) )
		( AT ?PLAYER0 ?LOCATION2 )
		( MOVE-DIR ?LOCATION3 ?LOCATION4 ?DIRECTION5 )
		( MOVE-DIR ?LOCATION2 ?LOCATION3 ?DIRECTION5 )
	)
  :EFFECT
	( AND
		( AT ?STONE1 ?LOCATION4 )
		( CLEAR ?LOCATION2 )
		( AT ?PLAYER0 ?LOCATION3 )
		( NOT ( AT ?STONE1 ?LOCATION3 ) )
		( NOT ( CLEAR ?LOCATION4 ) )
		( NOT ( AT ?PLAYER0 ?LOCATION2 ) )
	)
)
)

; problem
( DEFINE ( PROBLEM TYPED-SOKOBAN-GRID5-BOXES2-WALLS2 )
( :DOMAIN SOKOBAN-TEMPORAL )
( :OBJECTS
	F0-0F F0-1F F0-2F F0-3F F0-4F F1-0F F1-1F F1-2F F1-3F F1-4F F2-0F F2-1F F2-2F F2-3F F2-4F F3-0F F3-1F F3-2F F3-3F F3-4F F4-0F F4-1F F4-2F F4-3F F4-4F - LOCATION
	UP DOWN LEFT RIGHT - DIRECTION
	BOX0 BOX1 - STONE
	PLAYER - PLAYER
)
( :INIT
	( MOVE-DIR F0-0F F0-1F RIGHT )
	( MOVE-DIR F0-0F F1-0F DOWN )
	( MOVE-DIR F0-1F F0-0F LEFT )
	( MOVE-DIR F0-1F F0-2F RIGHT )
	( MOVE-DIR F0-1F F1-1F DOWN )
	( MOVE-DIR F0-2F F0-1F LEFT )
	( MOVE-DIR F0-2F F0-3F RIGHT )
	( MOVE-DIR F0-2F F1-2F DOWN )
	( MOVE-DIR F0-3F F0-2F LEFT )
	( MOVE-DIR F0-3F F0-4F RIGHT )
	( MOVE-DIR F0-3F F1-3F DOWN )
	( MOVE-DIR F0-4F F0-3F LEFT )
	( MOVE-DIR F0-4F F1-4F DOWN )
	( MOVE-DIR F1-0F F1-1F RIGHT )
	( MOVE-DIR F1-0F F0-0F UP )
	( MOVE-DIR F1-0F F2-0F DOWN )
	( MOVE-DIR F1-1F F1-0F LEFT )
	( MOVE-DIR F1-1F F1-2F RIGHT )
	( MOVE-DIR F1-1F F0-1F UP )
	( MOVE-DIR F1-1F F2-1F DOWN )
	( MOVE-DIR F1-2F F1-1F LEFT )
	( MOVE-DIR F1-2F F1-3F RIGHT )
	( MOVE-DIR F1-2F F0-2F UP )
	( MOVE-DIR F1-2F F2-2F DOWN )
	( MOVE-DIR F1-3F F1-2F LEFT )
	( MOVE-DIR F1-3F F1-4F RIGHT )
	( MOVE-DIR F1-3F F0-3F UP )
	( MOVE-DIR F1-3F F2-3F DOWN )
	( MOVE-DIR F1-4F F1-3F LEFT )
	( MOVE-DIR F1-4F F0-4F UP )
	( MOVE-DIR F1-4F F2-4F DOWN )
	( MOVE-DIR F2-0F F2-1F RIGHT )
	( MOVE-DIR F2-0F F1-0F UP )
	( MOVE-DIR F2-0F F3-0F DOWN )
	( MOVE-DIR F2-1F F2-0F LEFT )
	( MOVE-DIR F2-1F F2-2F RIGHT )
	( MOVE-DIR F2-1F F1-1F UP )
	( MOVE-DIR F2-1F F3-1F DOWN )
	( MOVE-DIR F2-2F F2-1F LEFT )
	( MOVE-DIR F2-2F F2-3F RIGHT )
	( MOVE-DIR F2-2F F1-2F UP )
	( MOVE-DIR F2-2F F3-2F DOWN )
	( MOVE-DIR F2-3F F2-2F LEFT )
	( MOVE-DIR F2-3F F2-4F RIGHT )
	( MOVE-DIR F2-3F F1-3F UP )
	( MOVE-DIR F2-3F F3-3F DOWN )
	( MOVE-DIR F2-4F F2-3F LEFT )
	( MOVE-DIR F2-4F F1-4F UP )
	( MOVE-DIR F2-4F F3-4F DOWN )
	( MOVE-DIR F3-0F F3-1F RIGHT )
	( MOVE-DIR F3-0F F2-0F UP )
	( MOVE-DIR F3-0F F4-0F DOWN )
	( MOVE-DIR F3-1F F3-0F LEFT )
	( MOVE-DIR F3-1F F3-2F RIGHT )
	( MOVE-DIR F3-1F F2-1F UP )
	( MOVE-DIR F3-1F F4-1F DOWN )
	( MOVE-DIR F3-2F F3-1F LEFT )
	( MOVE-DIR F3-2F F3-3F RIGHT )
	( MOVE-DIR F3-2F F2-2F UP )
	( MOVE-DIR F3-2F F4-2F DOWN )
	( MOVE-DIR F3-3F F3-2F LEFT )
	( MOVE-DIR F3-3F F3-4F RIGHT )
	( MOVE-DIR F3-3F F2-3F UP )
	( MOVE-DIR F3-3F F4-3F DOWN )
	( MOVE-DIR F3-4F F3-3F LEFT )
	( MOVE-DIR F3-4F F2-4F UP )
	( MOVE-DIR F3-4F F4-4F DOWN )
	( MOVE-DIR F4-0F F4-1F RIGHT )
	( MOVE-DIR F4-0F F3-0F UP )
	( MOVE-DIR F4-1F F4-0F LEFT )
	( MOVE-DIR F4-1F F4-2F RIGHT )
	( MOVE-DIR F4-1F F3-1F UP )
	( MOVE-DIR F4-2F F4-1F LEFT )
	( MOVE-DIR F4-2F F4-3F RIGHT )
	( MOVE-DIR F4-2F F3-2F UP )
	( MOVE-DIR F4-3F F4-2F LEFT )
	( MOVE-DIR F4-3F F4-4F RIGHT )
	( MOVE-DIR F4-3F F3-3F UP )
	( MOVE-DIR F4-4F F4-3F LEFT )
	( MOVE-DIR F4-4F F3-4F UP )
	( AT BOX0 F1-1F )
	( AT BOX1 F3-1F )
	( CLEAR F0-0F )
	( CLEAR F0-1F )
	( CLEAR F0-3F )
	( CLEAR F0-4F )
	( AT PLAYER F1-0F )
	( CLEAR F1-2F )
	( CLEAR F1-3F )
	( CLEAR F1-4F )
	( CLEAR F2-0F )
	( CLEAR F2-1F )
	( CLEAR F2-2F )
	( CLEAR F2-3F )
	( CLEAR F2-4F )
	( CLEAR F3-0F )
	( CLEAR F3-2F )
	( CLEAR F3-4F )
	( CLEAR F4-0F )
	( CLEAR F4-1F )
	( CLEAR F4-2F )
	( CLEAR F4-4F )
)
( :GOAL
	( AND
		( AT BOX0 F3-4F )
		( AT BOX1 F4-4F )
	)
)
)

; plan
1. (move player f1-0f f0-0f up)
   deleted: (clear f0-0f) (at player f1-0f)
   added: (clear f1-0f) (at player f0-0f)
   goals met: 0 of 2
2. (move player f0-0f f0-1f right)
   deleted: (clear f0-1f) (at player f0-0f)
   added: (clear f0-0f) (at player f0-1f)
   goals met: 0 of 2
3. (push player box0 f0-1f f1-1f f2-1f down)
   deleted: (at box0 f1-1f) (clear f2-1f) (at player f0-1f)
   added: (at box0 f2-1f) (clear f0-1f) (at player f1-1f)
   goals met: 0 of 2
4. (move player f1-1f f1-0f left)
   deleted: (clear f1-0f) (at player f1-1f)
   added: (clear f1-1f) (at player f1-0f)
   goals met: 0 of 2
5. (move player f1-0f f2-0f down)
   deleted: (clear f2-0f) (at player f1-0f)
   added: (clear f1-0f) (at player f2-0f)
   goals met: 0 of 2
6. (push player box0 f2-0f f2-1f f2-2f right)
   deleted: (at box0 f2-1f) (clear f2-2f) (at player f2-0f)
   added: (at box0 f2-2f) (clear f2-0f) (at player f2-1f)
   goals met: 0 of 2
7. (push player box0 f2-1f f2-2f f2-3f right)
   deleted: (at box0 f2-2f) (clear f2-3f) (at player f2-1f)
   added: (at box0 f2-3f) (clear f2-1f) (at player f2-2f)
   goals met: 0 of 2
8. (move player f2-2f f2-1f left)
   deleted: (clear f2-1f) (at player f2-2f)
   added: (clear f2-2f) (at player f2-1f)
   goals met: 0 of 2
9. (move player f2-1f f2-0f left)
   deleted: (clear f2-0f) (at player f2-1f)
   added: (clear f2-1f) (at player f2-0f)
   goals met: 0 of 2
10. (move player f2-0f f3-0f down)
   deleted: (clear f3-0f) (at player f2-0f)
   added: (clear f2-0f) (at player f3-0f)
   goals met: 0 of 2
11. (push player box1 f3-0f f3-1f f3-2f right)
   deleted: (at box1 f3-1f) (clear f3-2f) (at player f3-0f)
   added: (at box1 f3-2f) (clear f3-0f) (at player f3-1f)
   goals met: 0 of 2
12. (move player f3-1f f4-1f down)
   deleted: (clear f4-1f) (at player f3-1f)
   added: (clear f3-1f) (at player f4-1f)
   goals met: 0 of 2
13. (move player f4-1f f4-2f right)
   deleted: (clear f4-2f) (at player f4-1f)
   added: (clear f4-1f) (at player f4-2f)
   goals met: 0 of 2
14. (push player box1 f4-2f f3-2f f2-2f up)
   deleted: (at box1 f3-2f) (clear f2-2f) (at player f4-2f)
   added: (at box1 f2-2f) (clear f4-2f) (at player f3-2f)
   goals met: 0 of 2
15. (push player box1 f3-2f f2-2f f1-2f up)
   deleted: (at box1 f2-2f) (clear f1-2f) (at player f3-2f)
   added: (at box1 f1-2f) (clear f3-2f) (at player f2-2f)
   goals met: 0 of 2
16. (move player f2-2f f2-1f left)
   deleted: (clear f2-1f) (at player f2-2f)
   added: (clear f2-2f) (at player f2-1f)
   goals met: 0 of 2
17. (move player f2-1f f1-1f up)
   deleted: (clear f1-1f) (at player f2-1f)
   added: (clear f2-1f) (at player f1-1f)
   goals met: 0 of 2
18. (push player box1 f1-1f f1-2f f1-3f right)
   deleted: (at box1 f1-2f) (clear f1-3f) (at player f1-1f)
   added: (at box1 f1-3f) (clear f1-1f) (at player f1-2f)
   goals met: 0 of 2
19. (push player box1 f1-2f f1-3f f1-4f right)
   deleted: (at box1 f1-3f) (clear f1-4f) (at player f1-2f)
   added: (at box1 f1-4f) (clear f1-2f) (at player f1-3f)
   goals met: 0 of 2
20. (move player f1-3f f0-3f up)
   deleted: (clear f0-3f) (at player f1-3f)
   added: (clear f1-3f) (at player f0-3f)
   goals met: 0 of 2
21. (move player f0-3f f0-4f right)
   deleted: (clear f0-4f) (at player f0-3f)
   added: (clear f0-3f) (at player f0-4f)
   goals met: 0 of 2
22. (push player box1 f0-4f f1-4f f2-4f down)
   deleted: (at box1 f1-4f) (clear f2-4f) (at player f0-4f)
   added: (at box1 f2-4f) (clear f0-4f) (at player f1-4f)
   goals met: 0 of 2
23. (push player box1 f1-4f f2-4f f3-4f down)
   deleted: (at box1 f2-4f) (clear f3-4f) (at player f1-4f)
   added: (at box1 f3-4f) (clear f1-4f) (at player f2-4f)
   goals met: 0 of 2
24. (push player box1 f2-4f f3-4f f4-4f down)
   deleted: (at box1 f3-4f) (clear f4-4f) (at player f2-4f)
   added: (at box1 f4-4f) (clear f2-4f) (at player f3-4f)
   goals met: 1 of 2
25. (move player f3-4f f2-4f up)
   deleted: (clear f2-4f) (at player f3-4f)
   added: (clear f3-4f) (at player f2-4f)
   goals met: 1 of 2
26. (move player f2-4f f1-4f up)
   deleted: (clear f1-4f) (at player f2-4f)
   added: (clear f2-4f) (at player f1-4f)
   goals met: 1 of 2
27. (move player f1-4f f1-3f left)
   deleted: (clear f1-3f) (at player f1-4f)
   added: (clear f1-4f) (at player f1-3f)
   goals met: 1 of 2
28. (move player f1-3f f1-2f left)
   deleted: (clear f1-2f) (at player f1-3f)
   added: (clear f1-3f) (at player f1-2f)
   goals met: 1 of 2
29. (move player f1-2f f2-2f down)
   deleted: (clear f2-2f) (at player f1-2f)
   added: (clear f1-2f) (at player f2-2f)
   goals met: 1 of 2
30. (push player box0 f2-2f f2-3f f2-4f right)
   deleted: (at box0 f2-3f) (clear f2-4f) (at player f2-2f)
   added: (at box0 f2-4f) (clear f2-2f) (at player f2-3f)
   goals met: 1 of 2
31. (move player f2-3f f1-3f up)
   deleted: (clear f1-3f) (at player f2-3f)
   added: (clear f2-3f) (at player f1-3f)
   goals met: 1 of 2
32. (move player f1-3f f1-4f right)
   deleted: (clear f1-4f) (at player f1-3f)
   added: (clear f1-3f) (at player f1-4f)
   goals met: 1 of 2
33. (push player box0 f1-4f f2-4f f3-4f down)
   deleted: (at box0 f2-4f) (clear f3-4f) (at player f1-4f)
   added: (at box0 f3-4f) (clear f1-4f) (at player f2-4f)
   goals met: 2 of 2
